// задание 1
/* 
Запросите у пользователя число, возведите это число во
2-ю степень и выведите на экран.
*/

let num = prompt('Задание 1. Введите число:');
alert('Вторая степень числа ' + num + ' равна ' + (num ** 2));

// задание 2
/* 
Запросите у пользователя 2 числа и выведите среднее ариф-
метическое этих чисел.
*/

let firstNum = prompt('Задание 2. Введите первое число:');
let secondNum = prompt('Введите второе число:');
alert('Среднее арифметическое чисел равно ') + ((firstNum + secondNum) / 2);

// задание 3
/* 
Запросите у пользователя длину стороны квадрата и вы-
ведите площадь такого квадрата.
*/

let hight = prompt('Задание 3. Введите сторону квадрата:');
alert('Площадь квадрата равна ' + (hight ** 2));

// задание 4
/* 
Реализуйте конвертор из километров в мили (пользователь
вводит километры, программа выводит мили). 1 км = 0,621371
миль. Это значение укажите в коде как константу.
*/

let km = prompt('Задание 4. Введите кол-во километров:');
const mil = 0.621371;
alert(km + ' километров равно ' + (km * mili) + ' миль');

// задание 5
/* 
Реализуйте калькулятор. Пользователь вводит два числа,
а программа выводит результаты действий + - * / между
этими числами.
*/

let a = prompt('Задание 5. Введите первое число:');
let b = prompt('Введите второе число:');
let sum = a + b;
let razn = a - b;
let del = a / b;
let umn = a * b;
alert(a + ' + ' + b + ' = ' + sum + ',  ' + a + ' - ' + b + ' = ' + razn + ',  ' + a + ' / ' + b + ' = ' + del + ',  ' + a + ' * ' + b + ' = ' + umn );

// задание 6
/* 
Пользователь вводит значения a и b для формулы a * x + b = 0,
а программа считает и выводит значение x.
*/

let a2 = prompt('Задание 6. Уравнение a * x + b = 0. Введите a:');
let b2 = prompt('Введите b:');
let x = (0 - b2) / a2;
alert('x = ' + x);

// задание 7
/* 
Запросите у пользователя текущее время (часы и минуты)
и выведите, сколько часов и минут осталось до следующего
дня.
*/

let hours = prompt('Задание 7. Укажите текущее время(часы):');
let minuties = prompt('Укажите текущее время(минуты):');
if (minuties == 00 || minuties == 0) {
    let ostatok = 24 - hours;
    alert('Осталось времени до следующего дня: ' + ostatok + ' часов и 00 минут');
}
else {
    let ostatokHours = 23 - hours;
    let ostatokMinuties = 60 - minuties;
    alert('Осталось времени до следующего дня:' + ostatokHours + ' часов и ' + ostatokMinuties + ' минут');
}



// задание 8
/* 
Запросите у пользователя трехзначное число и выведите
вторую цифру этого числа. Для решения задачи используйте
оператор % (остаток от деления).
*/

let chislo = prompt('Задание 8. Введите трёхзначное число:');
let second = ((chislo % 100) - (chislo % 10)) / 10;
alert('Вторая цифра = ' + second);

// задание 9
/* 
Запросите у пользователя пятизначное число и переме-
стите последнюю цифру в начало (из числа 12345 должно
получиться число 51234).
*/

let fiveNum = prompt('Задание 9. Введите пятизначное число:');
let lastNum = fiveNum % 10;
let newNum = ((fiveNum - lastNum) / 10) + (lastNum * 10000);
alert('Новое число(перенесли последнюю цифу впереёд): ' + newNum)

// задание 10
/* 
Зарплата работника составляет $250 + 10% от продаж.
Запросите общую сумму продаж за месяц и посчитайте
зарплату.
*/

let sumProd = prompt('Введите сумму продаж за месяц(в долларах):')
let zarplata = 250 + (sumProd * 0.1)
alert('Ваша зарплата 250$ + 10% от суммы продаж = ' + zarplata + ' долларов')